x = []
num = 0

for i in range(5):
    num = int(input('enter number: '))
    x += [num]

print(len(x))      # נותן את אורך הרשימה

x += [12, 1]       #הוספת איברים לרשימה על ידי חיבור שתי רשימות
x.append(7)        # הוספת איבר אחד לרשימה על ידי פקודת append()
x *= 3             # הכפלת הרשימה
x[3] = 10          #החלפת איבר ברשימה
x.remove(4)        #מסירה איבר מרשימה (לפי איבר ולא לפי מיקום). רק את הראשון כמותו ברשימה

print(x)
print(len(x))
print(sum(x))          #מדפיס את סכום המספרים ברשימה
print(sum(x)/len(x))   #מדפיס את ממוצע המספרים ברשימה
print(max(x))          #מדפיס את המספר הכי גבוה ברשימה
print(min(x))          #מדפיס את המספר הכי נמוך ברשימה